TigoWebSox/TigoWebSoxAD-ejb/target/classes/META-INF/wsdl/172.30.13.44_8011/TIGOAPIServicios/SendNotificationRI/ProxyServices/SendNotificationRIPS_.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="SendNotificationRIProcess" targetNamespace="http://tigo.com.gt/SendNotificationRI" xmlns:WL5G3N5="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:WL5G3N4="http://tigo.com.gt/SendNotificationRI" xmlns:WL5G3N3="http://www.tigo.com/Core/Common/Error/V1" xmlns:WL5G3N2="http://www.tigo.com/SendNotificationResponse/V1" xmlns:WL5G3N0="http://schemas.xmlsoap.org/wsdl/" xmlns:WL5G3N1="http://www.tigo.com/SendNotificationRequest/V1">
    <WL5G3N0:documentation>https://wlstest-srv.tigo.com.gt:8002/soa-infra/services/TigoAPIServicios/SendNotificationRI!1.0/SendNotificationRIProcess.wsdl</WL5G3N0:documentation>
<wsp:Policy wsu:Id="wss_username_token_service_policy" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<sp:SupportingTokens xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
<wsp:Policy>
<sp:UsernameToken sp:IncludeToken="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy/IncludeToken/AlwaysToRecipient">
<wsp:Policy>
<sp:WssUsernameToken10/>
</wsp:Policy>
</sp:UsernameToken>
</wsp:Policy>
</sp:SupportingTokens>
</wsp:Policy>
    <wsdl:types>
        <xsd:schema xmlns:WL5G3N6="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:inp1="http://www.tigo.com/SendNotificationRequest/V1" xmlns:inp2="http://www.tigo.com/SendNotificationResponse/V1" xmlns:inp3="http://www.tigo.com/Core/Common/Error/V1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://tigo.com.gt/SendNotificationRI" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import namespace="http://www.tigo.com/SendNotificationRequest/V1" schemaLocation="http://172.30.13.44:8011/TIGOAPIServicios/SendNotificationRI/ProxyServices/SendNotificationRIPS_?SCHEMA%2FTIGOAPIServicios%2FSendNotificationRI%2FWSDL%2FXMLSchema_-1221864765"/>
        </xsd:schema>
        <xsd:schema xmlns:WL5G3N6="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:inp1="http://www.tigo.com/SendNotificationRequest/V1" xmlns:inp2="http://www.tigo.com/SendNotificationResponse/V1" xmlns:inp3="http://www.tigo.com/Core/Common/Error/V1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://tigo.com.gt/SendNotificationRI" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import namespace="http://www.tigo.com/SendNotificationResponse/V1" schemaLocation="http://172.30.13.44:8011/TIGOAPIServicios/SendNotificationRI/ProxyServices/SendNotificationRIPS_?SCHEMA%2FTIGOAPIServicios%2FSendNotificationRI%2FWSDL%2FXMLSchema_-1626256937"/>
        </xsd:schema>
        <xsd:schema xmlns:WL5G3N6="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:inp1="http://www.tigo.com/SendNotificationRequest/V1" xmlns:inp2="http://www.tigo.com/SendNotificationResponse/V1" xmlns:inp3="http://www.tigo.com/Core/Common/Error/V1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://tigo.com.gt/SendNotificationRI" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
            <xsd:import namespace="http://www.tigo.com/Core/Common/Error/V1" schemaLocation="http://172.30.13.44:8011/TIGOAPIServicios/SendNotificationRI/ProxyServices/SendNotificationRIPS_?SCHEMA%2FTIGOAPIServicios%2FSendNotificationRI%2FWSDL%2FXMLSchema_-672187849"/>
        </xsd:schema>
    </wsdl:types>
    <wsdl:message name="requestMessage">
        <wsdl:part name="part1" element="WL5G3N1:SendNotificationRequest"/>
    </wsdl:message>
    <wsdl:message name="replyMessage">
        <wsdl:part name="part1" element="WL5G3N2:SendNotificationResponse"/>
    </wsdl:message>
    <wsdl:message name="faultMessage">
        <wsdl:part name="part1" element="WL5G3N3:Error"/>
    </wsdl:message>
    <wsdl:portType name="SendNotificationRIPort">
        <wsdl:operation name="SendNotification">
            <wsdl:input message="WL5G3N4:requestMessage"/>
            <wsdl:output message="WL5G3N4:replyMessage"/>
            <wsdl:fault name="SendNotificationfault" message="WL5G3N4:faultMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="SendNotificationRIPortBinding" type="WL5G3N4:SendNotificationRIPort">
        <WL5G3N5:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
      <wsp:PolicyReference URI="#wss_username_token_service_policy" wsdl:required="false" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"/>
        <wsdl:operation name="SendNotification">
            <WL5G3N5:operation style="document" soapAction="SendNotification"/>
            <wsdl:input>
                <WL5G3N5:body use="literal" namespace="http://tigo.com.gt/SendNotificationRI"/>
            </wsdl:input>
            <wsdl:output>
                <WL5G3N5:body use="literal" namespace="http://tigo.com.gt/SendNotificationRI"/>
            </wsdl:output>
            <wsdl:fault name="SendNotificationfault">
                <WL5G3N5:fault name="SendNotificationfault" use="literal"/>
            </wsdl:fault>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="SendNotificationRIProcess">
        <wsdl:port name="SendNotificationRIPort_pt" binding="WL5G3N4:SendNotificationRIPortBinding">
            <WL5G3N5:address location="http://172.30.13.44/:8011/TIGOAPIServicios/SendNotificationRI/ProxyServices/SendNotificationRIPS_"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>